# Pandas agretation operations

In [39]:
import pandas as pd

In [40]:
df = pd.read_excel('../Data/Space_Base_Data.xlsx', sheet_name='Space Vehicles')
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

## Median

In [41]:
df['Liftoff Mass'].median()

249350.0

In [42]:
df.median(numeric_only=True).head()

LEO Payload           4560.0
GTO payload           2810.0
TLI/Mars payload      3550.0
Liftoff Height          42.0
Liftoff Mass        249350.0
dtype: float64

## Describe

In [43]:
df.describe()

,LEO Payload,GTO payload,TLI/Mars payload,Liftoff Height,Liftoff Mass,Successful flights,Total flights
count,188.000000,120.000000,5.000000,199.000000,2.000000e+02,202.000000,202.000000
mean,9533.922074,3759.575000,26368.000000,41.250025,3.242253e+05,25.079208,27.059406
std,24967.124983,3603.029042,45549.274089,16.513044,3.939500e+05,72.459243,75.539166
min,1.050000,73.000000,1740.000000,4.400000,9.500000e+02,0.000000,1.000000
25%,1390.000000,1237.500000,2650.000000,28.650000,1.026000e+05,2.000000,3.000000
50%,4560.000000,2810.000000,3550.000000,42.000000,2.493500e+05,6.000000,7.000000
75%,10337.500000,5197.500000,16800.000000,53.000000,4.147500e+05,15.000000,15.750000
max,310000.000000,26700.000000,107100.000000,110.600000,2.970000e+06,765.000000,786.000000

## Counts

In [44]:
df['Active'].value_counts()

RETIRED    141
ACTIVE      61
Name: Active, dtype: int64

In [45]:
# Normalize argument returns the percentages of the counts
df['Active'].value_counts(normalize=True)

RETIRED    0.69802
ACTIVE     0.30198
Name: Active, dtype: float64

## Groupby

In [46]:
df.value_counts('Class')

Class
MLV     111
SLV      61
---      14
HLV      12
SHLV      4
dtype: int64

In [50]:
class_gp = df.groupby('Country')

In [58]:
class_gp.get_group('United Kingdom')

,Rocket,Active,Country,LEO Payload,GTO payload,TLI/Mars payload,Liftoff Height,Liftoff Mass,Successful flights,Total flights,First launch,Last launch,Class,Carried Crews
44,Black Arrow,RETIRED,United Kingdom,135.0,NaN,NaN,13.0,18130.0,2,4,1969-06-27,1971-10-28,SLV,False

In [59]:
# You can also use the following to obtain the same result
filt = df['Country'] == 'United Kingdom'
df.loc[filt]

,Rocket,Active,Country,LEO Payload,GTO payload,TLI/Mars payload,Liftoff Height,Liftoff Mass,Successful flights,Total flights,First launch,Last launch,Class,Carried Crews
44,Black Arrow,RETIRED,United Kingdom,135.0,NaN,NaN,13.0,18130.0,2,4,1969-06-27,1971-10-28,SLV,False

In [63]:
class_gp['Class'].value_counts(normalize=True)

Country         Class
Brazil          SLV      1.000000
China           MLV      0.500000
                SLV      0.400000
                HLV      0.066667
                ---      0.033333
Europe          MLV      0.600000
                ---      0.133333
                HLV      0.133333
                SLV      0.133333
France          SLV      1.000000
India           MLV      0.800000
                SLV      0.200000
Iran            SLV      1.000000
Israel          SLV      1.000000
Japan           SLV      0.578947
                MLV      0.421053
New Zealand     SLV      1.000000
North Korea     SLV      1.000000
Russia          MLV      0.588235
                SLV      0.294118
                HLV      0.058824
                SHLV     0.058824
South Korea     SLV      1.000000
Ukraine         MLV      0.750000
                ---      0.250000
United Kingdom  SLV      1.000000
United States   MLV      0.600000
                SLV      0.173333
                ---      0.120000
                HLV      0.080000
                SHLV     0.026667
Name: Class, dtype: float64

In [65]:
class_gp['Liftoff Mass'].agg(['median', 'mean']).loc[['Brazil', 'China']]

           median           mean
Country
Brazil    50700.0   50700.000000
China    218125.0  251155.066667